# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [10]:
#Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

In [9]:
!ls

README.md    data.sqlite  data.sqlite3 images       index.ipynb

## Employees and their Office (a One-to-One join)

Return a dataframe with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [14]:
#Your code here
df = pd.DataFrame(cur.execute('''
                              select *
                              from employees
                              left join offices
                              using(officeCode)
                              order by firstName, lastName;
                              '''))
df.columns = [x[0] for x in cur.description]
df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088,Sales Rep,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,,Australia,NSW 2010,APAC
1,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056,Sales Manager (NA),San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
2,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102,Sales Rep,London,+44 20 7877 2041,25 Old Broad Street,Level 7,,UK,EC2N 1HN,EMEA
3,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
4,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,3,1143,Sales Rep,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA

## Customers and their Orders (a One-to-Many join)

Return a dataframe with all of the customers' first and last names along with details for each of their order numbers, order dates, and statuses.

In [20]:
# Your code here
df = pd.DataFrame(cur.execute('''
                              select contactFirstName, contactLastName, orderNumber, orderDate, Status
                              from customers
                              join orders
                              using(customerNumber);
                              '''))
df.columns = [x[0] for x in cur.description]
print(f'There are {len(df)} orders. Sample below:')
df.head()

There are 326 orders. Sample below:

  contactFirstName contactLastName orderNumber   orderDate   status
0          Carine          Schmitt       10123  2003-05-20  Shipped
1          Carine          Schmitt       10298  2004-09-27  Shipped
2          Carine          Schmitt       10345  2004-11-25  Shipped
3             Jean            King       10124  2003-05-21  Shipped
4             Jean            King       10278  2004-08-06  Shipped

## Customers and their Payments (another One-to-Many join)

Return a dataframe with all of the customers' first and last names along with details about their payments' amount and date of payment. Sort these results in descending order by the payment amount.

In [23]:
# Your code here
df = pd.DataFrame(cur.execute('''
                              select contactFirstName as first_name, contactLastName as last_name, amount, paymentDate
                              from customers
                              join payments
                              using(customerNumber)
                              order by amount desc;
                              '''))
df.columns = [x[0] for x in cur.description]
print(f'Found {len(df)} records.')
df.head()

Found 273 records.

  first_name last_name   amount paymentDate
0    Violeta   Benitez  9977.85  2003-11-08
1        Ben  Calaghan  9821.32  2003-10-17
2     Leslie    Taylor  9658.74  2004-12-06
3       Sean  Clenahan  9415.13  2004-07-28
4    Roland     Mendel  8807.12  2005-05-03

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a dataframe with all of the customers' first and last names along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

- Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [26]:
# Your code here
df = pd.DataFrame(cur.execute('''
                              select contactFirstName, contactLastName, productName, quantityOrdered, orderDate
                              from customers
                              join orders using (customerNumber)
                              join orderdetails using (orderNumber)
                              join products using (productCode)
                              order by orderDate desc;
                              '''))
df.columns = [x[0] for x in cur.description]
df.head()

,contactFirstName,contactLastName,productName,quantityOrdered,orderDate
0,Janine,Labrune,1962 LanciaA Delta 16V,38,2005-05-31
1,Janine,Labrune,1957 Chevy Pickup,33,2005-05-31
2,Janine,Labrune,1998 Chrysler Plymouth Prowler,28,2005-05-31
3,Janine,Labrune,1964 Mercedes Tour Bus,38,2005-05-31
4,Janine,Labrune,1926 Ford Fire Engine,19,2005-05-31

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!